In [66]:
import pandas as pd

In [67]:
df = pd.DataFrame({
    "a": [4, 5, 6, 6],
    "b": [7, 8, 9, 9],
    "c": [10, 11, 12, 12]
},
    index = [1, 2, 3, 4]
)

In [68]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [69]:
df[(df.a > 4) & (df.c == 12)]

   a  b   c
3  6  9  12
4  6  9  12

In [70]:
df.describe()

              a         b          c
count  4.000000  4.000000   4.000000
mean   5.250000  8.250000  11.250000
std    0.957427  0.957427   0.957427
min    4.000000  7.000000  10.000000
25%    4.750000  7.750000  10.750000
50%    5.500000  8.500000  11.500000
75%    6.000000  9.000000  12.000000
max    6.000000  9.000000  12.000000

In [71]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [74]:
df = df.drop_duplicates()

In [75]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12